using System;
class Программа
{
    public static void Main(string[] args)
    {

        int Размер_масива = 2;// Инициализация переменной для размера массива
                              //Console.WriteLine("Введите команду если желаете провести дополнительную настройку Для стандартного выполнения ведите пробел");
                              // if (Console.ReadLine() == "" || Console.ReadLine() == " " )
                              //Работу выполнил Горожанкин Николай Евгеньевич 


        // Ввод размерности массивов с обработкой ошибок
        Размер_масива = ЗРМ(Размер_масива);


        int[] Answer1 = new int[Размер_масива];// Создание первого массива
        int[] Answer2 = new int[Размер_масива];// Создание второго массива
        // Заполнение массивов значениями
        Console.WriteLine("Введите значения для первого массива:");
        Ввод_Масива(Answer1, Размер_масива);
        Console.WriteLine("Введите значения для второго массива:");
        Ввод_Масива(Answer2, Размер_масива);
        // Вычисление коэффициента Спирмена и вывод результатов
        double rs = Спирмен(Answer1, Answer2);
        string Ваше_Полное_Имя = "Горожанкин Николай Евгеньевич  ";
        string Ваша_Группа = "22ИС/25ИС ";
        Вывод_Конечного_Текста(rs, Ваше_Полное_Имя, Ваша_Группа);

        // else { Обработчик(Console.ReadLine()); }
    }

    // Функция для заполнения массива
    static void Ввод_Масива(int[] Answer, int Размер_масива)
    {
        for (int i = 0; i < Размер_масива; i++)
        {
            while (!int.TryParse(Console.ReadLine(), out Answer[i]))
            {
                Console.WriteLine("Недопустимый ввод. Введите целое число.");
            }
        }

    }
    // Функция для внесения значения о размерности мкасива 
    static int ЗРМ(int Размер_масива)
    {
        Console.WriteLine("Введите размерность для массивов (больше 1): ");
        while ((!int.TryParse(Console.ReadLine(), out Размер_масива) || Размер_масива <= 1))
        {
            Console.WriteLine("Размерность массива должна быть целым числом больше 1. Пожалуйста, введите корректное значение: ");

        }
        return Размер_масива;

    }
    // Функция для вывода результатов и информации о студенте
    static void Вывод_Конечного_Текста(double rs, string Ваше_Полное_Имя, string Ваша_Группа)
    {
        Console.WriteLine($"Коэффициент линейной корреляции Rs = {rs:F4}");
        Console.WriteLine($"Характер связи по шкале Чэддока: {ПечатьОтвета(rs)}");
        Console.WriteLine("Работу выполнил студент: " + Ваше_Полное_Имя);
        Console.WriteLine("Группа: " + Ваша_Группа);
        Console.ReadLine();

    }
    // Функция для вычисления коэффициента Спирмена
    static double Спирмен(int[] Answer1, int[] Answer2)
    {
        int n = Answer1.Length;
        int разность = 0;

        int сумма = 0;
        double Rs;
        // Расчет суммы квадратов разностей элементов массивов
        for (int i = 0; i < n; ++i)
        {
            разность = Answer1[i] - Answer2[i];
            разность = (int)Math.Pow(разность, 2);
            сумма += разность;
        }
        // Вычисление коэффициента Спирмена
        Rs = 1 - ((6 * сумма) / (n * (Math.Pow(n, 2) - 1)));
        return Rs;


    }
    // Функция для определения характера связи на основе коэффициента
    static string ПечатьОтвета(double rs)
    {
        string результат = "Ошибка резултат вне стандартных значений   ";

        if (rs >= 0.9 && rs <= 1.0)
        {
            результат = "Очень высокая положительная корреляция";
        }
        else if (rs >= 0.7 && rs < 0.9)
        {
            результат = "Высокая положительная корреляция";
        }
        else if (rs >= 0.5 && rs < 0.7)
        {
            результат = "Умеренная положительная корреляция";
        }
        else if (rs >= 0.3 && rs < 0.5)
        {
            результат = "Низкая положительная корреляция";
        }
        else if (rs >= -0.3 && rs < 0.3)
        {
            результат = "Нет или незначительная корреляция";
        }
        else if (rs >= -0.5 && rs < -0.3)
        {
            результат = "Низкая отрицательная корреляция";
        }
        else if (rs >= -0.7 && rs < -0.5)
        {
            результат = "Умеренная отрицательная корреляция";
        }
        else if (rs >= -0.9 && rs < -0.7)
        {
            результат = "Высокая отрицательная корреляция";
        }
        else if (rs >= -1.0 && rs < -0.9)
        {
            результат = "Очень высокая отрицательная корреляция";
        }

        return результат;
    }
    //static string Обработчик(string входная_строка)
    //{



    //    return "0";

    //}
}

